**2.1.Handling Missing Data**

2.1.1.Drop missing values

In [5]:
import pandas as pd
import numpy as np

In [6]:
data = {
    "Student":["Amina", "Brian", "Cathy", "Derrick", "Edna"],
    "Age":[21, None, 23, 22, None],
    "GPA":[3.0, 3.2, None, 3.5, 3.1],

}
df = pd.DataFrame(data)

In [7]:
df

   Student   Age  GPA
0    Amina  21.0  3.0
1    Brian   NaN  3.2
2    Cathy  23.0  NaN
3  Derrick  22.0  3.5
4     Edna   NaN  3.1

In [8]:
#drop all rows with missing values
df_dropped = df.dropna()

In [9]:
df_dropped

   Student   Age  GPA
0    Amina  21.0  3.0
3  Derrick  22.0  3.5

2.1.2 Fill with mean or median

In [10]:
df

   Student   Age  GPA
0    Amina  21.0  3.0
1    Brian   NaN  3.2
2    Cathy  23.0  NaN
3  Derrick  22.0  3.5
4     Edna   NaN  3.1

In [ ]:
#replace missing age with mean age
mean_age = df['Age'].mean()
df['Age'] = df['Age'].fillna(mean_age)

In [17]:
df['Age']

0    21.0
1    22.0
2    23.0
3    22.0
4    22.0
Name: Age, dtype: float64

In [19]:
#replace missing GPA with the median GPA
median_gpa = df['GPA'].median()
df['GPA'] = df['GPA'].fillna(median_gpa)

In [20]:
df['GPA']

0    3.00
1    3.20
2    3.15
3    3.50
4    3.10
Name: GPA, dtype: float64

In [21]:
print("Updated DataFrame:")
df

Updated DataFrame:

   Student   Age   GPA
0    Amina  21.0  3.00
1    Brian  22.0  3.20
2    Cathy  23.0  3.15
3  Derrick  22.0  3.50
4     Edna  22.0  3.10

2.1.3. Check and Count Nulls

In [22]:
#use .isnull() and .sum() to count missing values in each column
missing_values_count = df.isnull().sum()
print("Missing values in each column:")
print(missing_values_count)

Missing values in each column:
Student    0
Age        0
GPA        0
dtype: int64

In [23]:
#short code comment on which column had the most missing values and what actions you would take
# The 'Age' column had the most missing values (2 out of 5).
# I replaced the missing values with the mean age.